In [1]:
#Load the pandas library
import pandas as pd

In [3]:
#For the following data dictionary given below-
raw_data = {
    'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
    'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
    'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
    'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
    'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
    'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
    'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
    'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
    'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
    'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisiana', 'Georgia']
}
#Create a dataframe and assign it to a variable called df_army.
#Write the code below this comment.
df_army=pd.DataFrame(raw_data)
df_army.head()

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters,origin
0,Nighthawks,1st,523,5,1045,1,1,1,4,Arizona
1,Nighthawks,1st,52,42,957,5,2,0,24,California
2,Nighthawks,2nd,25,2,1099,62,3,1,31,Texas
3,Nighthawks,2nd,616,2,1400,26,3,1,2,Florida
4,Dragoons,1st,43,4,1592,73,2,0,3,Maine

In [5]:
#List all regiment names in your dataframe.
df_army['regiment']

0     Nighthawks
1     Nighthawks
2     Nighthawks
3     Nighthawks
4       Dragoons
5       Dragoons
6       Dragoons
7       Dragoons
8         Scouts
9         Scouts
10        Scouts
11        Scouts
Name: regiment, dtype: object

In [7]:
#Select the rows 3 to 7 and the columns 3 to 6.
df_army.iloc[3:8,3:7]

   battles  size  veterans  readiness
3        2  1400        26          3
4        4  1592        73          2
5        7  1006        37          1
6        8   987       949          2
7        3   849        48          3

In [8]:
#Select the 3rd column up to the 7th column
df_army.iloc[:,3:8]

    battles  size  veterans  readiness  armored
0         5  1045         1          1        1
1        42   957         5          2        0
2         2  1099        62          3        1
3         2  1400        26          3        1
4         4  1592        73          2        0
5         7  1006        37          1        1
6         8   987       949          2        0
7         3   849        48          3        1
8         4   973        48          2        0
9         7  1005       435          1        0
10        8  1099        63          2        1
11        9  1523       345          3        1

In [11]:
#Select all the regiments not named "Dragoons"
df_army[df_army['regiment'] != "Dragons"][['regiment','size']].head()

     regiment  size
0  Nighthawks  1045
1  Nighthawks   957
2  Nighthawks  1099
3  Nighthawks  1400
4    Dragoons  1592

In [29]:
#Select rows where deaths is greater than 500 or less than 50. Display only the company, deaths, and battles columns.

In [30]:
#create a dataframe with the df_army to load only these following columns only
#'regiment','size','veterans','readiness'. 
#Write the code below:

In [31]:
# Filter companies with deaths greater than 100. Write the code below.

In [32]:
# Count the number of companies from each origin.

In [33]:
# Filter companies with readiness level 3 and armored.

In [34]:
#Filter companies with size at least 1000

In [35]:
#Filter companies with veterans more than 50.

In [36]:
#Filter companies that participated in more than 5 battles

In [37]:
raw_data = {
    'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
    'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
    'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
    'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
    'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
    'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
    'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
    'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
    'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
    'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisiana', 'Georgia']
}
#Create a dataframe and assign it to a variable called df_army.
#Write the code below this comment.

In [38]:
#Filter companies from specific origins-such as-'California', 'Florida', 'Louisiana'

In [39]:
#Identify duplicate rows based on 'regiment' and 'company' columns

In [40]:
#Drop duplicate rows based on 'regiment' and 'company'.

In [41]:
#Calculate the total deaths and battles by regiment

In [42]:
#group the dataframe by regiment and iterate over it.

In [43]:
#group the dataframe by the column 'regiment and origin' and perform Agg method.